{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "dtype": "float32", "input_length": 1000, "input_dim": 110152, "trainable": true, "batch_input_shape": [null, 1000], "name": "embedding_1", "mask_zero": false, "output_dim": 128, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"dropout": 0.2, "implementation": 1, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "stateful": false, "return_state": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "use_bias": true, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "unit_forget_bias": true, "recurrent_dropout": 0.2, "units": 128, "trainable": true, "activation": "tanh", "name": "lstm_1", "kernel_regularizer": null, "return_sequences": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "activation": "sigmoid", "bias_constraint": null, "name": "dense_1"}}], "backend": "tensorflow", "keras_version": "2.1.2"}